Repository: Bunnn12/SnakeAndLaddersFinalProject
Catalog: SnakeAndLaddersFinalProject/Properties/Langs/Lang.*.resx
Languages: es_mx, pt, zh_hans

# bntInviteFriendText
source: Invite friend
es_mx: Invitar amigo
pt: Convidar amigo
zh_hans: 邀请好友

# btnAcceptText
source: Accept
es_mx: Aceptar
pt: Aceitar
zh_hans: 接受

# btnAddFriendText
source: Add friend
es_mx: Añadir amigo
pt: Adicionar amigo
zh_hans: 添加好友

# btnBackText
source: Back
es_mx: Regresar
pt: Voltar
zh_hans: 后退

# btnCancelText
source: Cancel
es_mx: Cancelar
pt: Cancelar
zh_hans: 取消

# btnCreateMatchText
source: Create Match
es_mx: Crear partida
pt: Criar correspondência
zh_hans: 创建匹配

# btnExploitingText
source: Exploiting
es_mx: Uso de hacks
pt: Explorando
zh_hans: 剥削

# btnFriendsText
source: Friends
es_mx: Amigos
pt: Amigos
zh_hans: 朋友们

# btnHarassmentText
source: Harassment
es_mx: Acoso
pt: Assédio
zh_hans: 骚扰

# btnInappropiateLangText
source: Inappropriate language
es_mx: Lenguaje inapropiado
pt: Linguagem inadequada
zh_hans: 不当语言

# btnInventoryText
source: Inventory
es_mx: Inventario
pt: Inventário
zh_hans: 存货

# btnJoinMatchText
source: Join match
es_mx: Unirse a partida
pt: Junte-se à partida
zh_hans: 加入比赛

# btnMainWindowText
source: Main window
es_mx: Ventana Principal
pt: Janela principal
zh_hans: 主窗口

# btnOtherReasonText
source: Other...
es_mx: Otro...
pt: Outro...
zh_hans: 其他...

# btnProfileText
source: Profile
es_mx: Perfil
pt: Perfil
zh_hans: 轮廓

# btnSettingsText
source: Settings
es_mx: Ajustes
pt: Configurações
zh_hans: 设置

# btnShopText
source: Shop
es_mx: Tienda
pt: Comprar
zh_hans: 店铺

# btnSignUpText
source: Sign up
es_mx: Registrarse
pt: Inscrever-se
zh_hans: 报名

# btnSkinsText
source: Skins
pt: Peles
zh_hans: 皮肤

# btnToxicBehaviorText
source: Toxic behavior
es_mx: Comportamiento tóxico
pt: Comportamento tóxico
zh_hans: 有毒行为

# btnUnfriendText
source: Unfriend
es_mx: Eliminar amigo
pt: Cancelar amizade
zh_hans: 解除好友关系

# character1DescriptionText
source: This character cries when she has an exam
es_mx: Este personaje llora cuando tiene un examen
pt: Esta personagem chora quando tem uma prova
zh_hans: 这个角色考试的时候哭了

# chatTittle
source: Chat
pt: Bater papo
zh_hans: 聊天

# lblAddFriends
source: Add friends
es_mx: Agregar amigos
pt: Adicionar amigos
zh_hans: 添加好友

# lblcharacterDescriptionText
source: Character description
es_mx: Descripción del personaje
pt: Descrição do personagem
zh_hans: 人物描述

# lblCoinsText
source: Coins
es_mx: Monedas
pt: Moedas
zh_hans: 硬币

# lblFindFriensText
source: Find friends
es_mx: Buscar amigos
pt: Encontre amigos
zh_hans: 寻找朋友

# lblFindMatchText
source: Find match
es_mx: Buscar partida
pt: Encontrar correspondência
zh_hans: 查找匹配项

# lblFriendsListTitle
source: Friends List
es_mx: Lista de amigos
pt: Lista de amigos
zh_hans: 好友列表

# lblMatchListTitle
source: Match List
es_mx: Lista de partidas
pt: Lista de correspondências
zh_hans: 比赛名单

# lblRegisterTitle
source: Create new account
es_mx: Crear cuenta nueva
pt: Criar nova conta
zh_hans: 创建新帐户

# lblStickersText
source: Stickers
pt: Adesivos
zh_hans: 贴纸

# listOfGamesTittle
source: List of games
es_mx: Lista de partidas
pt: Lista de jogos
zh_hans: 游戏列表

# pwdPasswordText
source: Password
es_mx: Contraseña
pt: Senha
zh_hans: 密码

# reportUserTittle
source: Report user
es_mx: Reportar usuario
pt: Denunciar usuário
zh_hans: 举报用户

# tvFriendsListText
source: Friends list
es_mx: Lista de amigos
pt: Lista de amigos
zh_hans: 好友列表

# txtChatMessageText
source: Type a message...
es_mx: Escribe un mensaje...
pt: Digite uma mensagem...
zh_hans: 输入消息...

# txtLastNameOfUserText
source: Lastname
pt: Sobrenome
zh_hans: 姓

# txtNameOfUserText
source: Name
es_mx: Nombre
pt: Nome
zh_hans: 姓名

# txtUsernameText
source: Username
es_mx: Usuario
pt: Nome de usuário
zh_hans: 用户名

# bntContinueText
source: Continue
es_mx: Continuar
pt: Continuar
zh_hans: 继续

# btnLoginText
source: Log in
es_mx: Iniciar sesion
pt: Conecte-se
zh_hans: 登录

# lblWelcomeText
source: Welcome to the game
es_mx: Bienvenido al juego
pt: Bem-vindo ao jogo
zh_hans: 欢迎来到游戏

# btnForgottenPasswordText
source: i forgot my password
es_mx: olvide mi contraseña
pt: esqueci minha senha
zh_hans: 我忘记了密码

# btnPlayAsGuestText
source: play as guest
es_mx: jugar como invitado
pt: jogar como convidado
zh_hans: 作为客人玩

# lblLobby
source: Lobby
es_mx: Sala de espera
pt: Salão
zh_hans: 大堂

# btnStartMatchText
source: start match
es_mx: iniciar partida
pt: começar a partida
zh_hans: 开始比赛

# btnExitMatchText
source: leave match
es_mx: dejar partida
pt: sair da partida
zh_hans: 离开比赛

# lblLanguage
source: language
es_mx: idioma
pt: linguagem
zh_hans: 语言

# lblSound
source: Sound
es_mx: Sonido
pt: Som
zh_hans: 声音

# lblMusic
source: music
es_mx: musica
pt: música
zh_hans: 音乐

# lblStore
source: Store
es_mx: Tienda
pt: Loja
zh_hans: 店铺

# btnBuy
source: buy
es_mx: Comprar
pt: comprar
zh_hans: 买

# lblCoinsQuantity
source: coins
es_mx: monedas
pt: moedas
zh_hans: 硬币

# lblInventory
source: inventory
es_mx: inventario
pt: inventário
zh_hans: 存货

# lblItems
source: items
es_mx: objetos
pt: Unid
zh_hans: 项目

# btnRankingText
source: Ranking
pt: Classificação
zh_hans: 排行

# lblEmailVerificationTitle
source: Email verification
es_mx: Verificación del correo electrónico
pt: Verificação de e-mail
zh_hans: 邮箱验证

# lblVerificationMessageText
source: Insert the verification code
es_mx: Inserte el código de verificación
pt: Insira o código de verificação
zh_hans: 输入验证码

# btnResendCodeText
source: Resend the code
es_mx: Reenviar el código
pt: Reenviar o código
zh_hans: 重新发送代码

# UiResendCodeInFmt
source: Resend in {0}s
es_mx: Reenviar en {0}s
pt: Reenviar em {0}s
zh_hans: {0} 秒后重新发送

# btnSendText
source: Send
es_mx: Enviar
pt: Enviar
zh_hans: 发送

# UiTitleInfo
source: Information
es_mx: Información
pt: Informação
zh_hans: 信息

# UiTitleError
source: Error
pt: Erro
zh_hans: 错误

# UiTitleWarning
source: Warning
es_mx: Advertencia
pt: Aviso
zh_hans: 警告

# UiLoginOk
source: Login successful. Welcome!
es_mx: Inicie sesión exitosamente. ¡Bienvenido!
pt: Login bem-sucedido. Bem-vindo!
zh_hans: 登录成功。欢迎！

# UiNameRequired
source: The name is required.
es_mx: El nombre es obligatorio.
pt: O nome é obrigatório.
zh_hans: 名称为必填项。

# UiLastNameRequired
source: Last name is required.
es_mx: Se requiere apellido.
pt: O sobrenome é obrigatório.
zh_hans: 姓氏为必填项。

# UiPasswordTooShort
source: Password: at least 8 characters.
es_mx: Contraseña: al menos 8 caracteres.
pt: Senha: pelo menos 8 caracteres.
zh_hans: 密码：至少8个字符。

# UiEmailInvalid
source: Invalid email.
es_mx: Correo electrónico no válido.
pt: E-mail inválido.
zh_hans: 电子邮件无效。

# UiGenericError
source: An error occurred:
es_mx: Se produjo un error:
pt: Ocorreu um erro:
zh_hans: 发生错误：

# UiEndpointNotFound
source: Server not found.
es_mx: Servidor no encontrado.
pt: Servidor não encontrado.
zh_hans: 未找到服务器。

# UiNoBackPage
source: No previous page.
es_mx: Sin página anterior.
pt: Nenhuma página anterior.
zh_hans: 没有上一页。

# UiUserNameRequired
source: Username is required
es_mx: El nombre de usuario es obligatorio
pt: O nome de usuário é obrigatório
zh_hans: 用户名是必需的

# UiEmailRequired
source: Email is required.
es_mx: Se requiere correo electrónico.
pt: O e-mail é obrigatório.
zh_hans: 需要电子邮件。

# UiPasswordRequired
source: Password is required.
es_mx: Se requiere contraseña.
pt: A senha é obrigatória.
zh_hans: 需要密码。

# lblMatchSettingsText
source: Match settings
es_mx: Configuración del partido
pt: Configurações de correspondência
zh_hans: 比赛设置

# lblDifficultyText
source: Difficulty
es_mx: Dificultad
pt: Dificuldade
zh_hans: 困难

# lblBoardSizeText
source: Board size
es_mx: Tamaño del tablero
pt: Tamanho do tabuleiro
zh_hans: 板尺寸

# lblPlayersText
source: Players
es_mx: Jugadores
pt: Jogadores
zh_hans: 玩家

# lblSpecialTilesText
source: Special tiles
es_mx: Azulejos especiales
pt: Ladrilhos especiais
zh_hans: 特种瓷砖

# ReasonForReportText
source: Reason for the report
es_mx: Razón del informe
pt: Razão do relatório
zh_hans: 报告原因

# btnReportPlayerText
source: Report player
es_mx: Denunciar jugador
pt: Denunciar jogador
zh_hans: 举报玩家

# reportReasonWindowTitle
source: Report reason
es_mx: Motivo del informe
pt: Motivo do relatório
zh_hans: 举报原因

# lblReportDetailText
source: Report detail
es_mx: Detalle del informe
pt: Detalhe do relatório
zh_hans: 报告详情

# OtherReasonWindowTitle
source: Other reason
es_mx: Otra razón
pt: Outro motivo
zh_hans: 其他原因

# OtherReasonDescriptionLabel
source: Report reason description
es_mx: Descripción del motivo del informe
pt: Descrição do motivo do relatório
zh_hans: 举报原因说明

# ReportGenericErrorMessage
source: An unexpected error occurred while processing your report. Please try again.
es_mx: Se produjo un error inesperado al procesar su informe. Por favor inténtalo de nuevo.
pt: Ocorreu um erro inesperado ao processar seu relatório. Por favor, tente novamente.
zh_hans: 处理您的报告时发生意外错误。请再试一次。

# ReportErrorDuplicate
source: You have already reported this player recently. Please wait for the sanction to be processed before reporting again.
es_mx: Ya denunciaste a este jugador recientemente. Espere a que se procese la sanción antes de volver a informar.
pt: Você já denunciou este jogador recentemente. Aguarde até que a sanção seja processada antes de denunciar novamente.
zh_hans: 您最近已经举报了该玩家。请等待制裁处理后再重新报告。

# ReportErrorInvalidUser
source: The report could not be processed because the player information is invalid.
es_mx: El informe no se pudo procesar porque la información del jugador no es válida.
pt: O relatório não pôde ser processado porque as informações do jogador são inválidas.
zh_hans: 由于玩家信息无效，无法处理该报告。

# ReportErrorInvalidRequest
source: The report request is invalid. Please try again.
es_mx: La solicitud de informe no es válida. Por favor inténtalo de nuevo.
pt: A solicitação de relatório é inválida. Por favor, tente novamente.
zh_hans: 报告请求无效。请再试一次。

# lblRankingTitleText
source: Players ranking
es_mx: Clasificación de jugadores
pt: Classificação dos jogadores
zh_hans: 选手排名

# colRankingUsernameHeader
source: Player
es_mx: Jugador
pt: Jogador
zh_hans: 玩家

# colRankingCoinsHeader
source: Coins
es_mx: Monedas
pt: Moedas
zh_hans: 硬币

# lblRankingFooterText
source: Players are sorted by their coin count
es_mx: Los jugadores están ordenados por su cantidad de monedas.
pt: Os jogadores são classificados pela contagem de moedas
zh_hans: 玩家按硬币数量排序

# btnInviteFriendsText
source: Invite friends
es_mx: invitar amigos
pt: Convide amigos
zh_hans: 邀请朋友

# friendAcceptedText
source: Friend request accepted
es_mx: Solicitud de amistad aceptada
pt: Pedido de amizade aceito
zh_hans: 已接受好友请求

# friendRejectedText
source: Friend request rejected
es_mx: Solicitud de amistad rechazada
pt: Pedido de amizade rejeitado
zh_hans: 好友请求被拒绝

# friendRequestCanceledText
source: Friend request canceled
es_mx: Solicitud de amistad cancelada
pt: Pedido de amizade cancelado
zh_hans: 好友请求已取消

# lblFriendRequestsTitle
source: Friend requests
es_mx: Solicitudes de amistad
pt: Pedidos de amizade
zh_hans: 好友请求

# lblIncomingRequests
source: Friend requests received
es_mx: Solicitudes de amistad recibidas
pt: Solicitações de amizade recebidas
zh_hans: 收到好友请求

# lblOutgoingRequests
source: Friend requests sent
es_mx: Solicitudes de amistad enviadas
pt: Solicitações de amizade enviadas
zh_hans: 已发送好友请求

# errorLoadingFriendsListText
source: Could not load friend list
es_mx: No se pudo cargar la lista de amigos
pt: Não foi possível carregar a lista de amigos
zh_hans: 无法加载好友列表

# errorLoadingRequestsText
source: Could not load requests
es_mx: No se pudieron cargar las solicitudes
pt: Não foi possível carregar solicitações
zh_hans: 无法加载请求

# errorSearchingUsersText
source: Error searching for users
es_mx: Error al buscar usuarios
pt: Erro ao procurar usuários
zh_hans: 搜索用户时出错

# errorSendingRequestText
source: Could not sent the request
es_mx: No se pudo enviar la solicitud
pt: Não foi possível enviar a solicitação
zh_hans: 无法发送请求

# friendRemovedOkText
source: Friend successfully removed
es_mx: Amigo eliminado exitosamente
pt: Amigo removido com sucesso
zh_hans: 好友删除成功

# friendRequestSentText
source: Friend request sent
es_mx: Solicitud de amistad enviada
pt: Pedido de amizade enviado
zh_hans: 好友请求已发送

# errorAcceptingRequestText
source: Error accepting the request
es_mx: Error al aceptar la solicitud
pt: Erro ao aceitar a solicitação
zh_hans: 接受请求时出错

# errorCancelingRequestText
source: Error canceling the request
es_mx: Error al cancelar la solicitud
pt: Erro ao cancelar a solicitação
zh_hans: 取消请求时出错

# errorRejectingRequestText
source: Error rejecting the request
es_mx: Error al rechazar la solicitud
pt: Erro ao rejeitar a solicitação
zh_hans: 拒绝请求时出错

# errorRemovingFriendText
source: Could not remove friend
es_mx: No se pudo eliminar amigo
pt: Não foi possível remover o amigo
zh_hans: 无法删除好友

# errorTitle
source: Error
pt: Erro
zh_hans: 错误

# infoTitle
source: Information
es_mx: Información
pt: Informação
zh_hans: 信息

# btnRejectText
source: Reject
es_mx: Rechazar
pt: Rejeitar
zh_hans: 拒绝

# btnFriendRequestsText
source: Friend requests
es_mx: Solicitudes de amistad
pt: Pedidos de amizade
zh_hans: 好友请求

# lblProfileTitle
source: My profile
es_mx: Mi perfil
pt: Meu perfil
zh_hans: 我的个人资料

# menuEditAccountText
source: Edit account
es_mx: Editar cuenta
pt: Editar conta
zh_hans: 编辑帐户

# menuDeleteAccountText
source: Delete account
es_mx: Eliminar cuenta
pt: Excluir conta
zh_hans: 删除帐户

# menuViewStatsText
source: View my stats
es_mx: Ver mis estadísticas
pt: Ver minhas estatísticas
zh_hans: 查看我的统计数据

# lblProfileEditModeText
source: Profile edit mode
es_mx: Modo de edición de perfil
pt: Modo de edição de perfil
zh_hans: 个人资料编辑模式

# btnChangeAvatarText
source: Change avatar
es_mx: Cambiar avatar
pt: Alterar avatar
zh_hans: 更改头像

# lblProfileUserNameCaptionText
source: Username
es_mx: Usuario
pt: Nome de usuário
zh_hans: 用户名

# lblProfileFirstNameText
source: First name
es_mx: Nombre de pila
pt: Primeiro nome
zh_hans: 名

# lblProfileLastNameText
source: Last name
es_mx: Apellido
pt: Sobrenome
zh_hans: 姓

# lblProfileDescriptionText
source: Description
es_mx: Descripción
pt: Descrição
zh_hans: 描述

# btnProfileEditText
source: Edit
es_mx: Editar
pt: Editar
zh_hans: 编辑

# btnProfileSaveText
source: Save
es_mx: Ahorrar
pt: Salvar
zh_hans: 节省

# lblSelectAvatarTitleText
source: Select your avatar
es_mx: Selecciona tu avatar
pt: Selecione seu avatar
zh_hans: 选择您的头像

# lblProfileStatsTitle
source: Statistics Profile
es_mx: Perfil estadístico
pt: Perfil de estatísticas
zh_hans: 统计概况

# lblStatsSectionTitle
source: Game Statistics
es_mx: Estadísticas del juego
pt: Estatísticas do jogo
zh_hans: 游戏统计

# lblMatchesPlayed
source: Matches Played
es_mx: Partidos jugados
pt: Partidas disputadas
zh_hans: 已踢比赛

# lblMatchesWon
source: Matches Won
es_mx: Partidos ganados
pt: Partidas vencidas
zh_hans: 赢得比赛

# lblMatchesLost
source: Matches Lost
es_mx: Partidos perdidos
pt: Partidas perdidas
zh_hans: 输掉的比赛

# lblWinPercentage
source: Win Rate
es_mx: Tasa de victorias
pt: Taxa de vitórias
zh_hans: 胜率

# lblCurrentCoins
source: Current Coins
es_mx: Monedas actuales
pt: Moedas atuais
zh_hans: 当前硬币

# lblMaxCoinsEver
source: Highest Coin Count Achieved
es_mx: Mayor recuento de monedas logrado
pt: Maior contagem de moedas alcançada
zh_hans: 达到最高硬币数

# lblRankingTop50Position
source: Top-50 Ranking Position
es_mx: Posición entre los primeros 50
pt: Posição no ranking dos 50 primeiros
zh_hans: 前50名排名位置

# lblAvatarSectionTitle
source: Skins
pt: Peles
zh_hans: 皮肤

# StickerSectionTitle
source: Stickers
pt: Adesivos
zh_hans: 贴纸

# lblDiceSectionTitle
source: Dice
es_mx: Dados
pt: Dados
zh_hans: 骰子

# lblItemSectionTitle
source: Items
es_mx: Elementos
pt: Unid
zh_hans: 项目

# lblShopAvatarCommonTitle
source: Common skin chest
es_mx: Cofre de skins común
pt: Peito de pele comum
zh_hans: 普通皮肤胸

# lblShopAvatarEpicTitle
source: Epic skin chest
es_mx: Cofre de skins épico
pt: Peito de pele épico
zh_hans: 史诗皮肤宝箱

# lblAvatarLegendaryTitle
source: Legendary skin chest
es_mx: Cofre de skins legendario
pt: Peito de pele lendário
zh_hans: 传奇皮肤宝箱

# lblAvatarCommonPrice
source: Price: 200 coins
es_mx: Precio: 200 monedas
pt: Preço: 200 moedas
zh_hans: 价格：200金币

# lblAvatarEpicPrice
source: Price: 400 coins
es_mx: Precio: 400 monedas
pt: Preço: 400 moedas
zh_hans: 价格：400金币

# lblAvatarLegendaryPrice
source: Price: 800 coins
es_mx: Precio: 800 monedas
pt: Preço: 800 moedas
zh_hans: 价格：800金币

# stickerCommonTitle
source: Common sticker chest
es_mx: Cofre de pegatinas común
pt: Baú de adesivos comum
zh_hans: 普通贴纸箱

# lblStickerEpicText
source: Epic sticker chest
es_mx: Cofre de pegatinas épico
pt: Baú de adesivos épico
zh_hans: 史诗般的贴纸宝箱

# StickerLegendaryText
source: Legendary sticker chest
es_mx: Cofre de pegatinas legendario
pt: Baú de adesivos lendário
zh_hans: 传奇贴纸宝箱

# lblStickerCommonPrice
source: Price: 150 coins
es_mx: Precio: 150 monedas
pt: Preço: 150 moedas
zh_hans: 价格：150币

# lblStickerEpicPrice
source: Price: 300 coins
es_mx: Precio: 300 monedas
pt: Preço: 300 moedas
zh_hans: 价格：300金币

# StickerLegendaryPrice
source: Price: 600 coins
es_mx: Precio: 600 monedas
pt: Preço: 600 moedas
zh_hans: 价格：600币

# lblDiceNegativeTitle
source: Negative dice
es_mx: dados negativos
pt: Dados negativos
zh_hans: 负骰子

# lblDice123Title
source: 1–3 dice
es_mx: 1-3 dados
pt: 1–3 dados
zh_hans: 1–3 个骰子

# lblDice456Title
source: 4–6 dice
es_mx: 4 a 6 dados
pt: 4–6 dados
zh_hans: 4–6 个骰子

# lblDiceNegativePrice
source: Price: 300 coins
es_mx: Precio: 300 monedas
pt: Preço: 300 moedas
zh_hans: 价格：300金币

# lblDice123Price
source: Price: 300 coins
es_mx: Precio: 300 monedas
pt: Preço: 300 moedas
zh_hans: 价格：300金币

# lblDice456Price
source: Price: 300 coins
es_mx: Precio: 300 monedas
pt: Preço: 300 moedas
zh_hans: 价格：300金币

# lblItemChestTitle
source: Item chest
es_mx: Cofre de artículos
pt: Baú de itens
zh_hans: 物品箱

# ItemChestPrice
source: Price: 500 coins
es_mx: Precio: 500 monedas
pt: Preço: 500 moedas
zh_hans: 价格：500金币

# UiShopRequiresLogin
source: You must sign in to use the shop
es_mx: Debes iniciar sesión para utilizar la tienda.
pt: Você deve fazer login para usar a loja
zh_hans: 您必须登录才能使用商店

# UiShopRequiresRegisteredUser
source: The shop is only available for registered accounts.
es_mx: La tienda sólo está disponible para cuentas registradas.
pt: A loja está disponível apenas para contas registradas.
zh_hans: 该商店仅适用于注册帐户。

# UiShopRequiresToken
source: Session token is missing. Please sign in again
es_mx: Falta el token de sesión. Por favor inicia sesión nuevamente
pt: O token da sessão está ausente. Faça login novamente
zh_hans: 会话令牌丢失。请重新登录

# UiShopPurchaseSuccessFmt
source: You obtained: {0}. Current coins: {1}
es_mx: Obtuviste: {0}. Monedas actuales: {1}
pt: Você obteve: {0}. Moedas atuais: {1}
zh_hans: 您获得：{0}。当前硬币：{1}

# ShopInvalidSessionError
source: Invalid session. Please sign in again
es_mx: Sesión no válida. Por favor inicia sesión nuevamente
pt: Sessão inválida. Faça login novamente
zh_hans: 无效会话。请重新登录

# ShopInvalidUserIdError
source: Invalid user
es_mx: Usuario no válido
pt: Usuário inválido
zh_hans: 无效用户

# ShopUserNotFoundError
source: User not found
es_mx: Usuario no encontrado
pt: Usuário não encontrado
zh_hans: 未找到用户

# ShopInsufficientCoinsWarn
source: You do not have enough coins for this purchase
es_mx: No tienes suficientes monedas para esta compra.
pt: Você não tem moedas suficientes para esta compra
zh_hans: 您没有足够的金币来进行此次购买

# ShopNoAvatarsForRarityWarn
source: There are no skins available for that rarity
es_mx: No hay skins disponibles para esa rareza.
pt: Não há skins disponíveis para essa raridade
zh_hans: 没有可用的稀有皮肤

# ShopNoStickerPacksWarn
source: There are no sticker packs available
es_mx: No hay paquetes de pegatinas disponibles
pt: Não há pacotes de adesivos disponíveis
zh_hans: 没有可用的贴纸包

# ShopInvalidDiceError
source: Invalid dice
es_mx: Dados no válidos
pt: Dados inválidos
zh_hans: 无效骰子

# ShopDiceNotFoundWarn
source: Requested dice was not found
es_mx: No se encontraron los dados solicitados.
pt: O dado solicitado não foi encontrado
zh_hans: 未找到请求的骰子

# ShopItemNotFoundWarn
source: Requested item was not found
es_mx: No se encontró el artículo solicitado
pt: O item solicitado não foi encontrado
zh_hans: 找不到请求的项目

# ShopServerError
source: A server error occurred in the shop
es_mx: Se produjo un error del servidor en la tienda.
pt: Ocorreu um erro de servidor na loja
zh_hans: 商店发生服务器错误

# ShopUnknownError
source: An unknown error occurred in the shop
es_mx: Se produjo un error desconocido en la tienda.
pt: Ocorreu um erro desconhecido na loja
zh_hans: 商店发生未知错误

# ShopDice123Info
source: Dice 1–3: Only rolls values from 1 to 3
es_mx: Dados 1 a 3: solo arroja valores del 1 al 3
pt: Dados 1–3: apenas rola valores de 1 a 3
zh_hans: 骰子 1–3：仅掷 1 到 3 的值

# ShopDice456Info
source: Dice 4–6: Only rolls values from 4 to 6
es_mx: Dados 4 a 6: solo arroja valores del 4 al 6
pt: Dados 4–6: apenas rola valores de 4 a 6
zh_hans: 骰子 4–6：仅掷 4 到 6 的值

# ShopDiceNegativeInfo
source: Negative dice: Increases chance of going backwards
es_mx: Dados negativos: aumenta la posibilidad de retroceder.
pt: Dados negativos: Aumenta a chance de voltar atrás
zh_hans: 负骰子：增加倒退的机会

# ShopItemChestInfo
source: Item chest: Random mix of power-ups, you have chance of shields, boosts and traps
es_mx: Cofre de artículos: combinación aleatoria de objetos, tienes posibilidades de escudos, potenciadores y trampas
pt: Baú de itens: mistura aleatória de power-ups, você tem chance de escudos, reforços e armadilhas
zh_hans: 物品箱：随机组合能量提升，你有机会获得护盾、增益和陷阱

# UiShopChestInfoTitle
source: Chest details
es_mx: Detalles del pecho
pt: Detalhes do baú
zh_hans: 胸部细节

# lblChangePasswordCurrentPasswordText
source: Current password
es_mx: Contraseña actual
pt: Senha atual
zh_hans: 当前密码

# lblChangePasswordInstructionText
source: Enter your current password and choose a new one
es_mx: Ingrese su contraseña actual y elija una nueva
pt: Digite sua senha atual e escolha uma nova
zh_hans: 输入您当前的密码并选择一个新密码

# lblChangePasswordNewPasswordText
source: New password
es_mx: Nueva contraseña
pt: Nova Senha
zh_hans: 新密码

# lblChangePasswordTitleText
source: Change password
es_mx: Cambiar la contraseña
pt: Alterar a senha
zh_hans: 更改密码

# btnChangePasswordText
source: Change password
es_mx: Cambiar la contraseña
pt: Alterar a senha
zh_hans: 更改密码

# lblChangePasswordConfirmPasswordText
source: Confirm new password
es_mx: Confirmar nueva contraseña
pt: Confirme a nova senha
zh_hans: 确认新密码

# lblChangePasswordFooterText
source: Your new password must meet the security requirements
es_mx: Su nueva contraseña debe cumplir con los requisitos de seguridad.
pt: Sua nova senha deve atender aos requisitos de segurança
zh_hans: 您的新密码必须符合安全要求

# UiChangePasswordGenericError
source: An error occurred while changing your password
es_mx: Se produjo un error al cambiar su contraseña.
pt: Ocorreu um erro ao alterar sua senha
zh_hans: 更改密码时发生错误

# UiChangePasswordInvalidCurrent
source: The current password is incorrect
es_mx: La contraseña actual es incorrecta
pt: A senha atual está incorreta
zh_hans: 当前密码不正确

# UiChangePasswordPasswordsDoNotMatch
source: New password and confirmation do not match
es_mx: La nueva contraseña y la confirmación no coinciden
pt: A nova senha e a confirmação não coincidem
zh_hans: 新密码与确认密码不匹配

# UiChangePasswordReusedPassword
source: The new password cannot be the same as your 3 previous passwords
es_mx: La nueva contraseña no puede ser la misma que sus 3 contraseñas anteriores
pt: A nova senha não pode ser igual às 3 senhas anteriores
zh_hans: 新密码不能与您之前的3次密码相同

# UiChangePasswordSuccess
source: Your password has been updated successfully
es_mx: Su contraseña ha sido actualizada exitosamente
pt: Sua senha foi atualizada com sucesso
zh_hans: 您的密码已成功更新
