Repository: Bunnn12/SnakeAndLaddersFinalProject
Catalog: SnakeAndLaddersFinalProject/Properties/Langs/Lang.*.resx
Languages: es_mx, pt, zh_hans

# Message6Text
source: You passed Programming Fundamentals the first time. Move forward 4 spaces.
es_mx: Acreditaste Fundamentos de Programación a la primera. Avanza 4 casillas.
pt: Você passou nos Fundamentos de Programação pela primeira vez. Avance 4 espaços.
zh_hans: 您第一次通过了编程基础知识。向前移动 4 个空格。

# Message7Text
source: IndexOutOfRangeException: you accessed outside the array goes back 5 spaces.
es_mx: IndexOutOfRangeException: accediste fuera del arreglo retrocede 5 casillas.
pt: IndexOutOfRangeException: você acessou fora do array retrocede 5 espaços.
zh_hans: IndexOutOfRangeException：您访问的数组外部返回了 5 个空格。

# Message8Text
source: You found a programming meme that gave you the strength to continue. You advance 4 spaces
es_mx: Encontraste un meme de programación que te dio fuerzas para continuar. Avanzas 4 casillas
pt: Você encontrou um meme de programação que lhe deu forças para continuar. Você avança 4 espaços
zh_hans: 您发现了一个编程模因，它给了您继续下去的力量。您前进 4 个空格

# Message9Text
source: Your technology teacher abandoned you to go to Peru and you were late in the project, go back 5 boxes
es_mx: Tu profe de tecnologías te abandono por irse a peru y te retrasaste en el poryecto retrocede 5 casillas
pt: Seu professor de tecnologia te abandonou para ir para o Peru e você atrasou o projeto, volte 5 caixas
zh_hans: 你的技术老师抛弃你去秘鲁，你的项目迟到了，回去5个盒子

# Message10Text
source: You finished a sequence diagram. Move forward 4 spaces
es_mx: Terminaste un diagrama de secuencia. Avanza 4 casillas
pt: Você terminou um diagrama de sequência. Avance 4 espaços
zh_hans: 您完成了序列图。向前移动 4 个空格

# Message11Text
source: NullReferenceException: You advanced without initializing. You lose your next turn.
es_mx: NullReferenceException: avanzaste sin inicializar. Pierdes tu siguiente turno.
pt: NullReferenceException: você avançou sem inicializar. Você perde seu próximo turno.
zh_hans: NullReferenceException：您在未初始化的情况下前进。你就失去了下一个回合。

# Message12Text
source: Your team left you alone on the final project. You are the hero no one asked for. you earned an extra turn
es_mx: Tu equipo te dejó solo en el proyecto final. Eres el héroe que nadie pidió. ganaste un turno extra
pt: Sua equipe deixou você sozinho no projeto final. Você é o herói que ninguém pediu. você ganhou um turno extra
zh_hans: 你的团队让你独自完成最终项目。你是无人要求的英雄。你赢得了额外回合

# Message13Text
source: Burnout detected… take a mandatory break. You lose a turn.
es_mx: Burnout detectado… toma un descanso obligatorio. Pierdes un turno.
pt: Burnout detectado… faça uma pausa obrigatória. Você perde uma vez.
zh_hans: 检测到倦怠……强制休息。你失去了一个回合。

# Message14Text
source: You passed the most difficult class of the semester. To celebrate. roll the dice again
es_mx: Pasaste la materia más difícil del semestre. A celebrar. vuelve a tirar el dado
pt: Você passou na aula mais difícil do semestre. Para comemorar. jogue os dados novamente
zh_hans: 你通过了本学期最难的一门课。庆祝一下。再次掷骰子

# Message15Text
source: You had to debug legacy code without documentation... good luck. we let you rest the next shift
es_mx: Te tocó debuggear código heredado sin documentacion… buena suerte. te dejamos descansar el siguiente turno
pt: Você teve que depurar código legado sem documentação... boa sorte. deixamos você descansar no próximo turno
zh_hans: 您必须在没有文档的情况下调试遗留代码......祝您好运。我们让你下一班休息

# Message16Text
source: You passed technologies at UO. You are a legend. You win a turn.
es_mx: Pasaste tecnologías en UO. Eres un leyenda. Ganas un turno.
pt: Você passou em tecnologias na UO. Você é uma lenda. Você ganha uma vez.
zh_hans: 您通过了俄勒冈大学的技术课程。你是一个传奇。你赢了一个回合。

# Message17Text
source: You have to clear 1 day of technical debt in sonarqube you lose a shift.
es_mx: Te toco limpiar 1 dia de deuda técnica en sonarqube pierdes un turno.
pt: Você tem que liquidar 1 dia de dívida técnica no sonarqube e perde um turno.
zh_hans: 你必须在 sonarqube 中清除 1 天的技术债务，否则你会失去一个班次。

# Message18Text
source: You passed technologies with 6...passing is passing. you throw again
es_mx: Pasaste tecnologías con 6...pasar es pasar. vuelves a tirar
pt: Você passou em tecnologias com 6...passar é passar. você joga de novo
zh_hans: 您以 6 分通过了技术……通过了就是通过了。你再扔一次

# Message19Text
source: You resorted to programming. you lose a turn
es_mx: Recursaste programación. pierdes un turno
pt: Você recorreu à programação. você perde uma vez
zh_hans: 你求助于编程。你失去了一个回合

# Message20Text
source: You are full stack in gpt chat prompts. It is your greatest achievement in life. you win a turn
es_mx: Eres full stack en prompts de chat gpt. Es tu mayor logro en la vida. ganas un turno
pt: Você está cheio de prompts de bate-papo do GPT. É a sua maior conquista na vida. você ganha uma vez
zh_hans: 您在 gpt 聊天提示中处于全栈状态。这是你一生中最大的成就。你赢得一个回合

# AuthCodeNotRequested
source: A verification code has not been requested yet. Please request a code first
es_mx: Aún no se ha solicitado un código de verificación. Por favor solicite un código primero
pt: Um código de verificação ainda não foi solicitado. Solicite um código primeiro
zh_hans: 尚未请求验证码。请先索取代码

# AuthOk
source: Operation completed successfully
es_mx: Operación completada con éxito
pt: Operação concluída com sucesso
zh_hans: 操作成功完成

# autoAcceptedFriendText
source: This user had already sent you a friend request, you are now friends
es_mx: Este usuario ya te había enviado una solicitud de amistad, ahora eres amigo
pt: Este usuário já lhe enviou um pedido de amizade, agora vocês são amigos
zh_hans: 该用户已向您发送好友请求，现在你们是好友

# ChatNoActiveLobbyWarnText
source: There is no active lobby yet. Create or join one before opening the chat
es_mx: Aún no hay ningún lobby activo. Crea o únete a uno antes de abrir el chat.
pt: Ainda não há lobby ativo. Crie ou participe de um antes de abrir o chat
zh_hans: 目前还没有活跃的大厅。在打开聊天之前创建或加入一个

# ConnectionLostMessage
source: The connection to the server was lost. You will be returned to the login screen
es_mx: Se perdió la conexión con el servidor. Volverá a la pantalla de inicio de sesión.
pt: A conexão com o servidor foi perdida. Você retornará à tela de login
zh_hans: 与服务器的连接丢失。您将返回到登录屏幕

# ConnectionLostTitle
source: Connection lost
es_mx: Conexión perdida
pt: Conexão perdida
zh_hans: 连接丢失

# GameBoardOpenErrorText
source: The game board could not be opened.
es_mx: No se pudo abrir el tablero de juego.
pt: O tabuleiro do jogo não pôde ser aberto.
zh_hans: 游戏板无法打开。

# GameEffectsFrozenFmt
source: Frozen ({0})
es_mx: Congelado ({0})
pt: Congelado ({0})
zh_hans: 冻结 ({0})

# GameEffectsRocketReadyText
source: Rocket ready
es_mx: Cohete listo
pt: Foguete pronto
zh_hans: 火箭准备就绪

# GameEffectsShieldFmt
source: Shield ({0})
es_mx: Escudo ({0})
pt: Escudo ({0})
zh_hans: 盾牌 ({0})

# GameItemAnchorBlockedFmt
source: {0} tried to use Anchor on {1}, but they are already on the starting cell
es_mx: {0} intentó usar Anchor en {1}, pero ya está en la celda inicial
pt: {0} tentou usar Anchor em {1}, mas já está na célula inicial
zh_hans: {0} 尝试在 {1} 上使用锚点，但它们已经位于起始单元格上

# GameItemAnchorUsedFmt
source: {0} used Anchor.
es_mx: {0} utilizó Ancla.
pt: {0} usou âncora.
zh_hans: {0} 使用了锚点。

# GameItemAnchorUsedOnPlayerFmt
source: {0} used Anchor on {1}
es_mx: {0} usó Anchor en {1}
pt: {0} usou âncora em {1}
zh_hans: {0} 在 {1} 上使用了 Anchor

# GameItemFreezeAppliedFmt
source: {0} froze {1}
es_mx: {0} se congeló {1}
pt: {0} congelou {1}
zh_hans: {0}冻结了{1}

# GameItemFreezeBlockedFmt
source: {0} tried to freeze {1}, but their shield blocked it.
es_mx: {0} intentó congelar a {1}, pero su escudo lo bloqueó.
pt: {0} tentou congelar {1}, mas o escudo bloqueou.
zh_hans: {0}试图冻结{1}，但他们的护盾挡住了它。

# GameItemFreezeUsedFmt
source: {0} used Freeze.
es_mx: {0} usó Congelar.
pt: {0} usou Congelar.
zh_hans: {0}使用了冻结。

# GameItemGenericUsedFmt
source: {0} used an item
es_mx: {0} usó un artículo
pt: {0} usou um item
zh_hans: {0}使用了一个项目

# GameItemRocketBlockedFmt
source: {0} tried to use Rocket on {1}, but their shield blocked it
es_mx: {0} intentó usar Rocket en {1}, pero su escudo lo bloqueó
pt: {0} tentou usar Rocket em {1}, mas o escudo bloqueou
zh_hans: {0}尝试在{1}上使用火箭，但他们的盾牌挡住了它

# GameItemRocketUsedFmt
source: {0} used Rocket
es_mx: {0} cohete usado
pt: {0} usou foguete
zh_hans: {0} 使用了火箭

# GameItemShieldUsedFmt
source: {0} activated Shield
es_mx: {0} escudo activado
pt: {0} escudo ativado
zh_hans: {0}激活护盾

# LoadingMainFrameNotFoundError
source: No Frame named 'MainFrame' was found in the window.
es_mx: No se encontró ningún marco llamado 'MainFrame' en la ventana.
pt: Nenhum quadro chamado 'MainFrame' foi encontrado na janela.
zh_hans: 在窗口中找不到名为“MainFrame”的框架。

# LobbyBannedAndKickedText
source: You have been banned and removed from the game
es_mx: Has sido baneado y eliminado del juego.
pt: Você foi banido e removido do jogo
zh_hans: 您已被禁止并从游戏中删除

# LobbyInitErrorText
source: The lobby could not be initialized.
es_mx: No se pudo inicializar el lobby.
pt: O lobby não pôde ser inicializado.
zh_hans: 大厅无法初始化。

# MainPageErrorLoadingCoinsText
source: An error occurred while loading your coins.
es_mx: Se produjo un error al cargar tus monedas.
pt: Ocorreu um erro ao carregar suas moedas.
zh_hans: 加载您的硬币时发生错误。

# PodiumDefaultPlayerNameFmt
source: Player {0}
es_mx: Jugador {0}
pt: Jogador {0}
zh_hans: 玩家{0}

# ProfileFirstNameRequiredText
source: The name cannot be in blank, please enter your name to continue
es_mx: El nombre no puede estar en blanco, ingresa tu nombre para continuar
pt: O nome não pode ficar em branco, digite seu nome para continuar
zh_hans: 姓名不能为空，请输入您的姓名继续

# ProfileLastNameRequiredText
source: The lastname cannot be in blank, please enter your lastname to continue
es_mx: El apellido no puede estar en blanco, ingrese su apellido para continuar
pt: O sobrenome não pode ficar em branco, digite seu sobrenome para continuar
zh_hans: 姓氏不能为空，请输入您的姓氏以继续

# ReportsWindowOpenErrorText
source: An error occurred while trying to open the reports window.
es_mx: Se produjo un error al intentar abrir la ventana de informes.
pt: Ocorreu um erro ao tentar abrir a janela de relatórios.
zh_hans: 尝试打开报告窗口时出错。

# SettingsLanguageApplyError
source: The selected language could not be applied.
es_mx: No se pudo aplicar el idioma seleccionado.
pt: O idioma selecionado não pôde ser aplicado.
zh_hans: 无法应用所选语言。

# SettingsLanguageInitError
source: The language could not be initialized
es_mx: No se pudo inicializar el idioma
pt: O idioma não pôde ser inicializado
zh_hans: 语言无法初始化

# StartCleanupErrorText
source: An error occurred while releasing video resources
es_mx: Se produjo un error al publicar recursos de video.
pt: Ocorreu um erro ao liberar recursos de vídeo
zh_hans: 释放视频资源时出错

# StartSoundFileNotFoundFmt
source: The sound file could not be found:{0}{1}
es_mx: No se pudo encontrar el archivo de sonido:{0}{1}
pt: O arquivo de som não foi encontrado:{0}{1}
zh_hans: 找不到声音文件：{0}{1}

# StartSoundPlayErrorText
source: An error occurred while playing the sound.
es_mx: Se produjo un error al reproducir el sonido.
pt: Ocorreu um erro ao reproduzir o som.
zh_hans: 播放声音时发生错误。

# StartVideoFileNotFoundFmt
source: The video file could not be found:{0}{1}
es_mx: No se pudo encontrar el archivo de vídeo:{0}{1}
pt: O arquivo de vídeo não foi encontrado:{0}{1}
zh_hans: 找不到视频文件：{0}{1}

# StartVideoLoadFailedText
source: The intro video could not be loaded. Please try again later.
es_mx: No se pudo cargar el vídeo de introducción. Inténtelo de nuevo más tarde.
pt: Não foi possível carregar o vídeo de introdução. Por favor, tente novamente mais tarde.
zh_hans: 无法加载介绍视频。请稍后重试。

# StartVideoLoadFailedTitle
source: Video could not be loaded
es_mx: No se pudo cargar el video
pt: Não foi possível carregar o vídeo
zh_hans: 视频无法加载

# StartVideoNotAvailableTitle
source: Video not available
es_mx: Vídeo no disponible
pt: Vídeo não disponível
zh_hans: 视频不可用

# StartVideoNotFoundText
source: No video file was found to play
es_mx: No se encontró ningún archivo de vídeo para reproducir.
pt: Nenhum arquivo de vídeo foi encontrado para ser reproduzido
zh_hans: 找不到可以播放的视频文件

# UiCommunicationError
source: A communication error occurred while contacting the server
es_mx: Se produjo un error de comunicación al contactar con el servidor.
pt: Ocorreu um erro de comunicação ao entrar em contato com o servidor
zh_hans: 联系服务器时发生通信错误

# UiGuestNamePrefix
source: Guest
es_mx: Invitado
pt: Convidado
zh_hans: 客人

# UiInvalidInput
source: Some fields contain invalid data. Please review your input.
es_mx: Algunos campos contienen datos no válidos. Por favor revise su entrada.
pt: Alguns campos contêm dados inválidos. Por favor, revise sua entrada.
zh_hans: 某些字段包含无效数据。请检查您的输入。

# UiIoError
source: An input/output error occurred while processing files or data.
es_mx: Se produjo un error de entrada/salida al procesar archivos o datos.
pt: Ocorreu um erro de entrada/saída durante o processamento de arquivos ou dados.
zh_hans: 处理文件或数据时发生输入/输出错误。

# UiJoinMatchCodeRequired
source: Please enter the match code
es_mx: Por favor ingrese el código de coincidencia
pt: Por favor insira o código de correspondência
zh_hans: 请输入匹配码

# UiJoinMatchTitle
source: Join match
es_mx: Unirse a partida
pt: Junte-se à partida
zh_hans: 加入比赛

# UiLoadingText
source: Loading...
es_mx: Cargando...
pt: Carregando...
zh_hans: 加载中...

# UiNavigationBackError
source: An error occurred while trying to go back
es_mx: Se produjo un error al intentar regresar
pt: Ocorreu um erro ao tentar voltar
zh_hans: 尝试返回时发生错误

# UiNavigationNoHistory
source: There is no navigation history or return action defined.
es_mx: No hay historial de navegación ni acción de retorno definida.
pt: Não há histórico de navegação ou ação de retorno definida.
zh_hans: 没有定义导航历史记录或返回操作。

# UiNetworkError
source: A network error occurred. Please check your connection
es_mx: Se produjo un error de red. Por favor revisa tu conexión
pt: Ocorreu um erro de rede. Verifique sua conexão
zh_hans: 发生网络错误。请检查您的连接

# UiOperationCanceled
source: The operation was canceled.
es_mx: La operación fue cancelada.
pt: A operação foi cancelada.
zh_hans: 操作被取消。

# UiSecurityError
source: A security error occurred while processing your request
es_mx: Se produjo un error de seguridad al procesar su solicitud.
pt: Ocorreu um erro de segurança ao processar sua solicitação
zh_hans: 处理您的请求时发生安全错误

# UiServiceError
source: The service reported an error while processing your request.
es_mx: El servicio informó un error al procesar su solicitud.
pt: O serviço relatou um erro ao processar sua solicitação.
zh_hans: 该服务在处理您的请求时报告了错误。

# UiTimeout
source: The operation timed out
es_mx: La operación expiró
pt: A operação expirou
zh_hans: 操作超时

# WindowTitleGameBoard
source: Snakes & Ladders - Game Board
es_mx: Serpientes y escaleras - Juego de mesa
pt: Cobras e Escadas - Tabuleiro de Jogo
zh_hans: 蛇梯棋 - 游戏板

# ChatInvalidLobbyIdText
source: Invalid lobby identifier
es_mx: Identificador de lobby no válido
pt: Identificador de lobby inválido

# CreateMatchErrorFmt
source: An error occurred while creating the match: {0}
es_mx: Se produjo un error al crear la coincidencia: {0}
pt: Ocorreu um erro ao criar a correspondência: {0}

# errorLoadingProfileStatsText
source: An error occurred while loading player stats. Please try again later.
es_mx: Se produjo un error al cargar las estadísticas del jugador. Inténtelo de nuevo más tarde.
pt: Ocorreu um erro ao carregar as estatísticas do jogador. Por favor, tente novamente mais tarde.

# errorProfileStatsInvalidUserIdText
source: Unable to load stats. Invalid user identifier.
es_mx: No se pueden cargar estadísticas. Identificador de usuario no válido.
pt: Não foi possível carregar as estatísticas. Identificador de usuário inválido.

# errorRankingCommunicationText
source: Could not communicate with the server to retrieve the ranking.
es_mx: No se pudo comunicar con el servidor para recuperar la clasificación.
pt: Não foi possível comunicar com o servidor para recuperar a classificação.

# errorRankingServerFaultTextFmt
source: The server reported an error while retrieving the ranking:{0}{1}
es_mx: El servidor informó de un error al recuperar la clasificación:{0}{1}
pt: O servidor relatou um erro ao recuperar a classificação:{0}{1}

# errorRankingUnexpectedText
source: An unexpected error occurred while loading the player ranking. Please try again later.
es_mx: Se produjo un error inesperado al cargar la clasificación de los jugadores. Inténtelo de nuevo más tarde.
pt: Ocorreu um erro inesperado ao carregar a classificação do jogador. Por favor, tente novamente mais tarde.

# friendRequestNoLongerExistsText
source: This friend request no longer exists or has already been processed.
es_mx: Esta solicitud de amistad ya no existe o ya ha sido procesada.
pt: Este pedido de amizade não existe mais ou já foi processado.

# FriendUnfriendConfirmText
source: Remove this user from your friends list?
es_mx: ¿Eliminar a este usuario de tu lista de amigos?
pt: Remover este usuário da sua lista de amigos?

# FriendUnfriendConfirmTitle
source: Confirm action
es_mx: Confirmar acción
pt: Confirmar ação

# GameCallbackRegistrationErrorText
source: An error occurred while registering for gameplay callbacks
es_mx: Se produjo un error al registrarse para recibir llamadas de juego
pt: Ocorreu um erro ao registrar-se para retornos de chamada de jogo

# GameDefaultPlayerNameFmt
source: Player {0}
es_mx: Jugador {0}
pt: Jogador {0}

# GameDiceRollFailurePrefixText
source: Could not roll the dice:
es_mx: No se pudo tirar los dados:
pt: Não foi possível lançar os dados:

# GameDiceRollUnexpectedErrorText
source: An unexpected error occurred while rolling the dice.
es_mx: Se produjo un error inesperado al tirar los dados.
pt: Ocorreu um erro inesperado ao lançar os dados.

# GameDiceSlotSelectedFmt
source: Dice in slot {0} selected for the next roll
es_mx: Dados en la ranura {0} seleccionados para el siguiente lanzamiento
pt: Dados no slot {0} selecionado para o próximo lançamento

# GameItemUseCancelledText
source: Item use was cancelled.
es_mx: Se canceló el uso del artículo.
pt: O uso do item foi cancelado.

# GameItemUseFailurePrefixText
source: Could not use the item:
es_mx: No se pudo utilizar el artículo:
pt: Não foi possível usar o item:

# GameItemUseUnexpectedErrorText
source: An error occurred while using the item.
es_mx: Se produjo un error al usar el artículo.
pt: Ocorreu um erro ao usar o item.

# GameSelectTargetPlayerText
source: Select the target player by clicking their avatar.
es_mx: Selecciona el jugador objetivo haciendo clic en su avatar.
pt: Selecione o jogador alvo clicando em seu avatar.

# GameStateSyncErrorText
source: An error occurred while synchronizing the game state
es_mx: Se produjo un error al sincronizar el estado del juego.
pt: Ocorreu um erro ao sincronizar o estado do jogo

# GameTimeoutKickPlayerText
source: A player was removed from the match due to inactivity
es_mx: Un jugador fue eliminado del partido por inactividad
pt: Um jogador foi removido da partida por inatividade

# GameTimeoutSkipTurnText
source: A player missed their turn due to time
es_mx: Un jugador perdió su turno por falta de tiempo
pt: Um jogador perdeu a vez devido ao tempo

# GameUnknownErrorText
source: An unknown error occurred
es_mx: Se produjo un error desconocido
pt: Ocorreu um erro desconhecido

# lblProfileUnknownUserText
source: Unknown player
es_mx: Jugador desconocido
pt: Jogador desconhecido

# lblRankingTitle
source: Ranking
pt: Classificação

# LobbyCreatedStatusFmt
source: Lobby created. Code {0}. Limit {1}. Expires at {2} UTC
es_mx: Se creó el lobby. Código {0}. Límite {1}. Vence a las {2} UTC
pt: Lobby criado. Código {0}. Limite {1}. Expira em {2} UTC

# LobbyJoinSuccessFmt
source: Joined {0}. Host: {1}. {2}/{3}
es_mx: Se unió a {0}. Anfitrión: {1}. {2}/{3}
pt: Ingressou em {0}. Anfitrião: {1}. {2}/{3}

# LobbyKickedWithoutReasonText
source: You have been removed from the lobby.
es_mx: Te han eliminado del lobby.
pt: Você foi removido do lobby.

# LobbyKickedWithReasonFmt
source: You have been removed from the lobby: {0}
es_mx: Te han eliminado del lobby: {0}
pt: Você foi removido do lobby: {0}

# LobbyStartMatchFailedText
source: The match could not be started
es_mx: No se pudo iniciar el partido
pt: A partida não pôde ser iniciada

# LobbyStartMatchInProgressText
source: Starting match...
es_mx: Partida inicial...
pt: Começando a partida...

# OtherReasonMinLengthMessageFmt
source: The report reason must have at least {0} characters.
es_mx: El motivo del informe debe tener al menos {0} caracteres.
pt: O motivo da denúncia deve ter pelo menos {0} caracteres.

# PodiumCoinsFmt
source: {0} coins
es_mx: {0} monedas
pt: {0} moedas

# PodiumTitleDefault
source: Match results
es_mx: Resultados del partido
pt: Resultados da partida

# PodiumWinnerFallbackFmt
source: Player with Id {0}
es_mx: Jugador con ID {0}
pt: Jogador com ID {0}

# ProfileUnknownUserNameText
source: Unknown
es_mx: Desconocido
pt: Desconhecido

# ReportConfirmMessageFormat
source: Do you want to report {0} for the following reason: {1}?
es_mx: ¿Quiere denunciar {0} por el siguiente motivo: {1}?
pt: Deseja denunciar {0} pelo seguinte motivo: {1}?

# ReportEndpointNotFoundMessage
source: The report service is not available. Please try again later.
es_mx: El servicio de informes no está disponible. Inténtelo de nuevo más tarde.
pt: O serviço de relatório não está disponível. Por favor, tente novamente mais tarde.

# ReportInvalidContextMessage
source: The report cannot be sent because the current context is not valid
es_mx: El informe no se puede enviar porque el contexto actual no es válido.
pt: O relatório não pode ser enviado porque o contexto atual não é válido

# ReportSentSuccessfullyMessage
source: Your report has been sent successfully.
es_mx: Su informe ha sido enviado exitosamente.
pt: Seu relatório foi enviado com sucesso.

# ReportUnknownUserDisplayName
source: Unknown user
es_mx: Usuario desconocido
pt: Usuário desconhecido

# UiPasswordWeak
source: Password must be at least {0} characters long and contain at least one uppercase letter, one lowercase letter, and one special character.
es_mx: La contraseña debe tener al menos {0} caracteres y contener al menos una letra mayúscula, una letra minúscula y un carácter especial.
pt: A senha deve ter pelo menos {0} caracteres e conter pelo menos uma letra maiúscula, uma letra minúscula e um caractere especial.

# btnKickPlayerText
source: Kick player
es_mx: jugador de patada
pt: Chutar jogador

# LobbyKickConfirmTextFmt
source: Do you want to remove {0} from the lobby?
es_mx: ¿Quieres eliminar a {0} del lobby?
pt: Deseja remover {0} do lobby?

# LobbyKickConfirmTitle
source: Remove player
es_mx: Eliminar jugador
pt: Remover jogador

# LobbyKickedByHostText
source: You have been removed from the lobby by the host
es_mx: El anfitrión te ha eliminado del lobby.
pt: Você foi removido do lobby pelo anfitrião

# LobbyKickFailedText
source: The player could not be removed from the lobby
es_mx: El jugador no pudo ser eliminado del lobby.
pt: O jogador não pôde ser removido do lobby

# LobbyKickPlayerMenuText
source: Kick player
es_mx: jugador de patada
pt: Chutar jogador

# GameDiceMoveBackwardFmt
source: You rolled {0} and moved back from {1} to {2} ({3} tiles).
es_mx: Obtuviste {0} y retrocediste de {1} a {2} ({3} mosaicos).
pt: Você rolou {0} e voltou de {1} para {2} ({3} peças).

# GameDiceMoveForwardFmt
source: You rolled {0} and moved from {1} to {2}.
es_mx: Obtuviste {0} y pasaste de {1} a {2}.
pt: Você rolou {0} e passou de {1} para {2}.

# GameDiceNoMovementFmt
source: You did not move this turn. You remain on tile {0}.
es_mx: No te moviste este turno. Permaneces en el mosaico {0}.
pt: Você não se moveu neste turno. Você permanece no bloco {0}.

# GameDiceResultTitle
source: Dice result
es_mx: Resultado de los dados
pt: Resultado dos dados
