Repository: Bunnn12/SnakeAndLaddersFinalProject
Catalog: SnakeAndLaddersFinalProject/Properties/Langs/Lang.*.resx
Languages: es_mx, pt, zh_hans

# UiChangePasswordWeakPassword
source: The new password does not meet the security requirements
es_mx: La nueva contraseña no cumple con los requisitos de seguridad.
pt: A nova senha não atende aos requisitos de segurança
zh_hans: 新密码不符合安全要求

# lblChangePasswordCodeText
source: Verification code
es_mx: Código de verificación
pt: Código de verificação
zh_hans: 验证码

# btnSendCodeText
source: Send code
es_mx: Enviar código
pt: Enviar código
zh_hans: 发送代码

# UiChangePasswordCodeSent
source: A verification code was sent to your email
es_mx: Se envió un código de verificación a su correo electrónico.
pt: Um código de verificação foi enviado para seu e-mail
zh_hans: 验证码已发送至您的邮箱

# UiChangePasswordCodeNotRequested
source: You must request a verification code before changing your password
es_mx: Debes solicitar un código de verificación antes de cambiar tu contraseña
pt: Você deve solicitar um código de verificação antes de alterar sua senha
zh_hans: 更改密码之前您必须请求验证码

# UiChangePasswordCodeExpired
source: The verification code has expired. Please request a new one
es_mx: El código de verificación ha caducado. Por favor solicite uno nuevo
pt: O código de verificação expirou. Solicite um novo
zh_hans: 验证码已过期。请索取新的

# UiChangePasswordCodeInvalid
source: The verification code is not valid
es_mx: El código de verificación no es válido.
pt: O código de verificação não é válido
zh_hans: 验证码无效

# AuthAccountDeleted
source: This account has been deleted.
es_mx: Esta cuenta ha sido eliminada.
pt: Esta conta foi excluída.
zh_hans: 该帐户已被删除。

# AuthBannedGeneric
source: This account is currently banned.
es_mx: Esta cuenta está actualmente prohibida.
pt: Esta conta está atualmente banida.
zh_hans: 该帐户目前已被禁止。

# AuthBannedPermanent
source: This account has been permanently banned.
es_mx: Esta cuenta ha sido prohibida permanentemente.
pt: Esta conta foi banida permanentemente.
zh_hans: 该账号已被永久封禁。

# AuthBannedUntilFmt
source: This account is banned until {0}.
es_mx: Esta cuenta está prohibida hasta el {0}.
pt: Esta conta está banida até {0}.
zh_hans: 此帐户在 {0} 之前被禁止。

# AuthCodeExpired
source: The verification code has expired. Please request a new one.
es_mx: El código de verificación ha caducado. Por favor solicite uno nuevo.
pt: O código de verificação expirou. Solicite um novo.
zh_hans: 验证码已过期。请索取一份新的。

# AuthCodeInvalid
source: The verification code is not valid.
es_mx: El código de verificación no es válido.
pt: O código de verificação não é válido.
zh_hans: 验证码无效。

# AuthEmailAlreadyExists
source: This email address is already registered.
es_mx: Esta dirección de correo electrónico ya está registrada.
pt: Este endereço de e-mail já está registrado.
zh_hans: 该电子邮件地址已被注册。

# AuthEmailRequired
source: Email is required.
es_mx: Se requiere correo electrónico.
pt: O e-mail é obrigatório.
zh_hans: 需要电子邮件。

# AuthEmailSendFailed
source: We could not send the email. Please try again later.
es_mx: No pudimos enviar el correo electrónico. Inténtelo de nuevo más tarde.
pt: Não foi possível enviar o e-mail. Por favor, tente novamente mais tarde.
zh_hans: 我们无法发送电子邮件。请稍后重试。

# AuthInvalidCredentials
source: Invalid credentials, please verify them
es_mx: Credenciales no válidas, verifíquelas
pt: Credenciais inválidas, verifique-as
zh_hans: 凭证无效，请验证

# AuthServerError
source: A server error occurred while processing your request.
es_mx: Se produjo un error en el servidor al procesar su solicitud.
pt: Ocorreu um erro no servidor ao processar sua solicitação.
zh_hans: 处理您的请求时服务器发生错误。

# AuthThrottleWaitFmt
source: Please wait {0} seconds before requesting a new code.
es_mx: Espere {0} segundos antes de solicitar un nuevo código.
pt: Aguarde {0} segundos antes de solicitar um novo código.
zh_hans: 请等待 {0} 秒，然后再请求新代码。

# AuthUserNameAlreadyExists
source: The username is already taken.
es_mx: El nombre de usuario ya está en uso.
pt: O nome de usuário já está em uso.
zh_hans: 用户名已被占用。

# Auth_ThrottleWaitFmt
source: Please wait {0} seconds before trying again.
es_mx: Espere {0} segundos antes de volver a intentarlo.
pt: Aguarde {0} segundos antes de tentar novamente.
zh_hans: 请等待 {0} 秒，然后重试。

# String1AuthOk
source: Operation completed successfully.
es_mx: La operación se completó con éxito.
pt: Operação concluída com sucesso.
zh_hans: 操作成功完成。

# UiAccountCreatedFmt
source: Your account "{0}" has been created successfully.
es_mx: Su cuenta "{0}" se ha creado correctamente.
pt: Sua conta "{0}" foi criada com sucesso.
zh_hans: 您的帐户“{0}”已成功创建。

# UiEmailTooLong
source: Email address cannot be longer than 200 characters.
es_mx: La dirección de correo electrónico no puede tener más de 200 caracteres.
pt: O endereço de e-mail não pode ter mais de 200 caracteres.
zh_hans: 电子邮件地址不能超过 200 个字符。

# UiFirstNameLettersOnly
source: First name can only contain letters.
es_mx: El nombre sólo puede contener letras.
pt: O primeiro nome só pode conter letras.
zh_hans: 名字只能包含字母。

# UiFirstNameRequired
source: First name is required.
es_mx: Se requiere el nombre.
pt: O primeiro nome é obrigatório.
zh_hans: 名字为必填项。

# UiFirstNameTooLong
source: First name cannot be longer than 90 characters.
es_mx: El nombre no puede tener más de 90 caracteres.
pt: O primeiro nome não pode ter mais de 90 caracteres.
zh_hans: 名字不能超过 90 个字符。

# UiIdentifierRequired
source: Username or email is required.
es_mx: Se requiere nombre de usuario o correo electrónico.
pt: Nome de usuário ou e-mail é obrigatório.
zh_hans: 需要用户名或电子邮件。

# UiIdentifierTooLong
source: The username or email is too long.
es_mx: El nombre de usuario o el correo electrónico son demasiado largos.
pt: O nome de usuário ou e-mail é muito longo.
zh_hans: 用户名或电子邮件太长。

# UiIdentifierTooShort
source: The username or email is too short.
es_mx: El nombre de usuario o el correo electrónico son demasiado cortos.
pt: O nome de usuário ou e-mail é muito curto.
zh_hans: 用户名或电子邮件太短。

# UiLastNameLettersOnly
source: Last name can only contain letters.
es_mx: El apellido sólo puede contener letras.
pt: O sobrenome só pode conter letras.
zh_hans: 姓氏只能包含字母。

# UiLastNameTooLong
source: Last name cannot be longer than 90 characters.
es_mx: El apellido no puede tener más de 90 caracteres.
pt: O sobrenome não pode ter mais de 90 caracteres.
zh_hans: 姓氏不能超过 90 个字符。

# UiPasswordPolicyDescription
source: The password must have at least 8 characters, one uppercase letter, one lowercase letter, one number and one special character.
es_mx: La contraseña debe tener al menos 8 caracteres, una letra mayúscula, una letra minúscula y un carácter especial.
pt: A senha deve ter no mínimo 8 caracteres, sendo uma letra maiúscula, uma letra minúscula e um caractere especial.
zh_hans: 密码必须至少包含 8 个字符，其中 1 个大写字母、1 个小写字母和 1 个特殊字符。

# UiPasswordTooLong
source: Password is too long
es_mx: La contraseña es demasiado larga
pt: A senha é muito longa
zh_hans: 密码太长

# UiSessionTokenMissingWarn
source: Session started, but the service did not return a token. Some features may not be available.
es_mx: La sesión comenzó, pero el servicio no devolvió ningún token. Es posible que algunas funciones no estén disponibles.
pt: A sessão foi iniciada, mas o serviço não retornou um token. Alguns recursos podem não estar disponíveis.
zh_hans: 会话已启动，但服务未返回令牌。某些功能可能不可用。

# UiUnexpectedNavigationError
source: An unexpected error occurred while navigating.
es_mx: Se produjo un error inesperado al navegar.
pt: Ocorreu um erro inesperado durante a navegação.
zh_hans: 导航时发生意外错误。

# UiUserNameTooLong
source: Username cannot be longer than 30 characters.
es_mx: El nombre de usuario no puede tener más de 90 caracteres.
pt: O nome de usuário não pode ter mais de 90 caracteres.
zh_hans: 用户名不能超过 90 个字符。

# UiVerificationCodeRequired
source: Verification code is required.
es_mx: Se requiere código de verificación.
pt: O código de verificação é obrigatório.
zh_hans: 需要验证码。

# UiVerificationSentFmt
source: A verification email was sent to {0}.
es_mx: Se envió un correo electrónico de verificación a {0}.
pt: Um e-mail de verificação foi enviado para {0}.
zh_hans: 验证电子邮件已发送至 {0}。

# btnSendInvitationText
source: Send invitation
es_mx: Enviar invitación
pt: Enviar convite
zh_hans: 发送邀请

# InviteInactiveFriendWarn
source: This friend cannot be invited because their account is inactive.
es_mx: No se puede invitar a este amigo porque su cuenta está inactiva.
pt: Este amigo não pode ser convidado porque a conta dele está inativa.
zh_hans: 无法邀请该朋友，因为他们的帐户处于非活动状态。

# InviteInvalidSessionError
source: The session is not valid. Please sign in again.
es_mx: La sesión no es válida. Por favor inicia sesión nuevamente.
pt: A sessão não é válida. Faça login novamente.
zh_hans: 会话无效。请重新登录。

# InviteNoFriendsInfo
source: You do not have any friends to invite yet.
es_mx: Aún no tienes amigos para invitar.
pt: Você ainda não tem amigos para convidar.
zh_hans: 您还没有可以邀请的朋友。

# InviteNoLobbyContextError
source: Lobby context was not found.
es_mx: No se encontró el contexto del lobby.
pt: O contexto do lobby não foi encontrado.
zh_hans: 未找到大厅上下文。

# InviteNoMatchCodeWarn
source: There is no active match with a code to invite friends.
es_mx: No hay ninguna coincidencia activa con un código para invitar amigos.
pt: Não há correspondência ativa com código para convidar amigos.
zh_hans: 没有有效的匹配代码来邀请朋友。

# InviteNoServerResponseError
source: No response was received from the server.
es_mx: No se recibió respuesta del servidor.
pt: Nenhuma resposta foi recebida do servidor.
zh_hans: 没有收到服务器的响应。

# InviteSelectFriendWarn
source: You must select a friend to send an invitation.
es_mx: Debes seleccionar un amigo para enviarle una invitación.
pt: Você deve selecionar um amigo para enviar um convite.
zh_hans: 您必须选择一位朋友才能发送邀请。

# InviteSendFailedText
source: The invitation could not be sent.
es_mx: No se pudo enviar la invitación.
pt: Não foi possível enviar o convite.
zh_hans: 无法发送邀请。

# InviteSentOkText
source: Invitation sent successfully.
es_mx: Invitación enviada exitosamente.
pt: Convite enviado com sucesso.
zh_hans: 邀请已成功发送。

# InviteSessionExpiredWarn
source: Your session has expired. Please sign in again.
es_mx: Tu sesión ha caducado. Por favor inicia sesión nuevamente.
pt: Sua sessão expirou. Faça login novamente.
zh_hans: 您的会话已过期。请重新登录。

# lblInviteFriendsToMatchText
source: Invite friends to the match
es_mx: Invitar amigos al partido.
pt: Convide amigos para a partida
zh_hans: 邀请好友参加比赛

# colFriendNoteHeader
source: Notes
es_mx: Notas
pt: Notas
zh_hans: 笔记

# UiInviteFriendFailureDefault
source: The invitation could not be sent.
es_mx: No se pudo enviar la invitación.
pt: Não foi possível enviar o convite.
zh_hans: 无法发送邀请。

# UiInviteFriendGuestsNotAllowed
source: Guests cannot send match invitations. Please sign in with an account.
es_mx: Los invitados no pueden enviar invitaciones a partidos. Por favor inicia sesión con una cuenta.
pt: Os convidados não podem enviar convites para jogos. Faça login com uma conta.
zh_hans: 客人无法发送比赛邀请。请使用帐户登录。

# UiInviteFriendInvalidSession
source: The session is not valid. Please sign in again.
es_mx: La sesión no es válida. Por favor inicia sesión nuevamente.
pt: A sessão não é válida. Faça login novamente.
zh_hans: 会话无效。请重新登录。

# UiInviteFriendLobbyContextMissing
source: Lobby context was not found.
es_mx: No se encontró el contexto del lobby.
pt: O contexto do lobby não foi encontrado.
zh_hans: 未找到大厅上下文。

# UiInviteFriendMissingGameCode
source: Match code is missing. Please create or join a match again.
es_mx: Falta el código de coincidencia. Por favor, crea o únete a una partida nuevamente.
pt: O código de correspondência está faltando. Crie ou participe de uma partida novamente.
zh_hans: 缺少匹配代码。请重新创建或加入比赛。

# UiInviteFriendNoMatchCode
source: There is no match with a code to invite friends yet.
es_mx: Aún no hay ninguna coincidencia con un código para invitar amigos.
pt: Ainda não há correspondência com um código para convidar amigos.
zh_hans: 尚无匹配的邀请好友代码。

# UiInviteFriendNoResponse
source: No response was received from the server.
es_mx: No se recibió respuesta del servidor.
pt: Nenhuma resposta foi recebida do servidor.
zh_hans: 没有收到服务器的响应。

# UiInviteFriendSelectFriendRequired
source: You must select a friend before sending an invitation.
es_mx: Debes seleccionar un amigo antes de enviar una invitación.
pt: Você deve selecionar um amigo antes de enviar um convite.
zh_hans: 您必须在发送邀请之前选择一位朋友。

# UiInviteFriendSuccessDefault
source: Invitation sent successfully.
es_mx: Invitación enviada exitosamente.
pt: Convite enviado com sucesso.
zh_hans: 邀请已成功发送。

# warningTitle
source: Warning
es_mx: Advertencia
pt: Aviso
zh_hans: 警告

# lblProfileSocialNetworksText
source: Social networks
es_mx: Redes sociales
pt: Redes sociais
zh_hans: 社交网络

# ProfileAccountInfoLoadError
source: Could not retrieve the account information.
es_mx: No se pudo recuperar la información de la cuenta.
pt: Não foi possível recuperar as informações da conta.
zh_hans: 无法检索帐户信息。

# ProfileAvatarUpdateErrorText
source: The avatar could not be updated.
es_mx: No se pudo actualizar el avatar.
pt: O avatar não pôde ser atualizado.
zh_hans: 头像无法更新。

# ProfileAvatarUpdateSuccessText
source: Avatar updated successfully.
es_mx: Avatar actualizado exitosamente.
pt: Avatar atualizado com sucesso.
zh_hans: 头像更新成功。

# ProfileChangeAvatarConfirmText
source: Do you want to use this avatar as your profile picture?
es_mx: ¿Quieres utilizar este avatar como tu foto de perfil?
pt: Quer usar este avatar como sua foto de perfil?
zh_hans: 您想使用此头像作为您的个人资料图片吗？

# ProfileChangeAvatarConfirmTitle
source: Change avatar
es_mx: Cambiar avatar
pt: Alterar avatar
zh_hans: 更改头像

# ProfileDeactivateConfirmText
source: Are you sure you want to deactivate your account?\nYou will not be able to use it again until an administrator reactivates it.
es_mx: ¿Está seguro de que desea desactivar su cuenta?\nNo podrá volver a usarla hasta que un administrador la reactive.
pt: Tem certeza de que deseja desativar sua conta?\nVocê não poderá usá-la novamente até que um administrador a reative.
zh_hans: 您确定要停用您的帐户吗？\n在管理员重新激活该帐户之前，您将无法再次使用该帐户。

# ProfileDeactivateConfirmTitle
source: Deactivate account
es_mx: Desactivar cuenta
pt: Desativar conta
zh_hans: 停用帐户

# ProfileDeactivateErrorText
source: An error occurred while deactivating the account.
es_mx: Se produjo un error al desactivar la cuenta.
pt: Ocorreu um erro ao desativar a conta.
zh_hans: 停用帐户时发生错误。

# ProfileDeactivateSuccessText
source: Your account has been deactivated successfully. The application will now close.
es_mx: Su cuenta ha sido desactivada exitosamente. La aplicación ahora se cerrará.
pt: Sua conta foi desativada com sucesso. O aplicativo será fechado agora.
zh_hans: 您的帐户已成功停用。该应用程序现在将关闭。

# ProfileDeactivateSuccessTitle
source: Account deactivated
es_mx: Cuenta desactivada
pt: Conta desativada
zh_hans: 帐户已停用

# ProfileDescriptionTooLongFmt
source: Description cannot be longer than {0} characters.
es_mx: La descripción no puede tener más de {0} caracteres.
pt: A descrição não pode ter mais de {0} caracteres.
zh_hans: 说明不能超过 {0} 个字符。

# ProfileFirstNameInvalidCharsText
source: The first name contains characters that are not allowed.
es_mx: El nombre contiene caracteres que no están permitidos.
pt: O primeiro nome contém caracteres que não são permitidos.
zh_hans: 名字包含不允许的字符。

# ProfileFirstNameTooLongFmt
source: First name cannot be longer than {0} characters.
es_mx: El nombre no puede tener más de {0} caracteres.
pt: O nome não pode ter mais de {0} caracteres.
zh_hans: 名字不能超过 {0} 个字符。

# ProfileGuestNotAllowedText
source: You signed in as a guest, so you cannot access the profile.\n\nIf you want to use a profile, please create an account.
es_mx: Usted inició sesión como invitado, por lo que no puede acceder al perfil.\n\nSi desea utilizar un perfil, cree una cuenta.
pt: Você fez login como convidado e não pode acessar o perfil.\n\nSe quiser usar um perfil, crie uma conta.
zh_hans: 您以访客身份登录，因此无法访问配置文件。\n\n如果您想使用配置文件，请创建一个帐户。

# ProfileGuestNotAllowedTitle
source: Profile not available
es_mx: Perfil no disponible
pt: Perfil não disponível
zh_hans: 个人资料不可用

# ProfileInvalidCharactersText
source: The text contains invalid characters.
es_mx: El texto contiene caracteres no válidos.
pt: O texto contém caracteres inválidos.
zh_hans: 文本包含无效字符。

# ProfileLastNameInvalidCharsText
source: The last name contains characters that are not allowed.
es_mx: El apellido contiene caracteres que no están permitidos.
pt: O sobrenome contém caracteres que não são permitidos.
zh_hans: 姓氏包含不允许的字符。

# ProfileLastNameTooLongFmt
source: Last name cannot be longer than {0} characters.
es_mx: El apellido no puede tener más de {0} caracteres.
pt: O sobrenome não pode ter mais de {0} caracteres.
zh_hans: 姓氏不能超过 {0} 个字符。

# ProfileMenuUnlinkFmt
source: Unlink {0}
es_mx: Desvincular {0}
pt: Desvincular {0}
zh_hans: 取消链接{0}

# ProfileNotFoundText
source: Profile not found.
es_mx: Perfil no encontrado.
pt: Perfil não encontrado.
zh_hans: 未找到个人资料。

# ProfileNotLoadedError
source: The profile has not been loaded.
es_mx: El perfil no ha sido cargado.
pt: O perfil não foi carregado.
zh_hans: 配置文件尚未加载。

# ProfileSocialNotLinkedText
source: (not linked)
es_mx: (no vinculado)
pt: (não vinculado)
zh_hans: （未链接）

# ProfileUpdateErrorText
source: The profile could not be updated.
es_mx: No se pudo actualizar el perfil.
pt: O perfil não pôde ser atualizado.
zh_hans: 无法更新个人资料。

# ProfileUpdateSuccessText
source: Profile updated successfully.
es_mx: Perfil actualizado exitosamente.
pt: Perfil atualizado com sucesso.
zh_hans: 个人资料更新成功。

# ProfileUserNameUnavailableText
source: Username is not available.
es_mx: El nombre de usuario no está disponible.
pt: O nome de usuário não está disponível.
zh_hans: 用户名不可用。

# ProfileUserNotLoadedError
source: The user profile has not been loaded.
es_mx: El perfil de usuario no se ha cargado.
pt: O perfil do usuário não foi carregado.
zh_hans: 用户配置文件尚未加载。

# SocialBrowserOpenError
source: The browser could not be opened.
es_mx: No se pudo abrir el navegador.
pt: O navegador não pôde ser aberto.
zh_hans: 浏览器无法打开。

# SocialNetworkNotLinkedInfo
source: This social network is not linked.
es_mx: Esta red social no está vinculada.
pt: Esta rede social não está vinculada.
zh_hans: 该社交网络未链接。

# SocialProfileInvalidUrlWarn
source: The link does not seem to be a valid profile URL for this social network.\nMake sure to paste the full URL to your profile (not the home page).
es_mx: El enlace no parece ser una URL de perfil válida para esta red social.\nAsegúrese de pegar la URL completa en su perfil (no en la página de inicio).
pt: O link não parece ser um URL de perfil válido para esta rede social.\nCertifique-se de colar o URL completo em seu perfil (não na página inicial).
zh_hans: 该链接似乎不是该社交网络的有效个人资料 URL。\n请确保将完整 URL 粘贴到您的个人资料（而不是主页）。

# SocialProfileLinkedInfo
source: Social network profile linked successfully.
es_mx: Perfil de red social vinculado exitosamente.
pt: Perfil de rede social vinculado com sucesso.
zh_hans: 社交网络个人资料链接成功。

# SocialProfileLinkEmptyWarn
source: The profile link cannot be empty.
es_mx: El enlace del perfil no puede estar vacío.
pt: O link do perfil não pode estar vazio.
zh_hans: 个人资料链接不能为空。

# SocialProfileLinkError
source: An error occurred while linking the social network profile.
es_mx: Se produjo un error al vincular el perfil de la red social.
pt: Ocorreu um erro ao vincular o perfil da rede social.
zh_hans: 链接社交网络个人资料时出错。

# SocialProfileLinkFacebookCaption
source: URL of your Facebook profile:
es_mx: URL de tu perfil de Facebook:
pt: URL do seu perfil do Facebook:
zh_hans: 您的 Facebook 个人资料的 URL：

# SocialProfileLinkFacebookTitle
source: Link Facebook
es_mx: Enlace Facebook
pt: Vincular Facebook
zh_hans: 链接脸书

# SocialProfileLinkGenericCaption
source: URL of your profile:
es_mx: URL de tu perfil:
pt: URL do seu perfil:
zh_hans: 您的个人资料的网址：

# SocialProfileLinkGenericTitle
source: Link social network
es_mx: Enlace red social
pt: Vincular rede social
zh_hans: 链接社交网络

# SocialProfileLinkInstagramCaption
source: URL of your Instagram profile:
es_mx: URL de tu perfil de Instagram:
pt: URL do seu perfil do Instagram:
zh_hans: 您的 Instagram 个人资料的 URL：

# SocialProfileLinkInstagramTitle
source: Link Instagram
es_mx: Enlace Instagram
pt: Vincular Instagram
zh_hans: 链接 Instagram

# SocialProfileLinkInstructionsText
source: Your browser will open so you can sign in. Then paste here the URL of your profile as shown there.
es_mx: Su navegador se abrirá para que pueda iniciar sesión. Luego pegue aquí la URL de su perfil como se muestra allí.
pt: Seu navegador será aberto para que você possa fazer login. Em seguida, cole aqui a URL do seu perfil conforme mostrado lá.
zh_hans: 您的浏览器将打开，以便您可以登录。然后将您的个人资料的 URL 粘贴到此处，如图所示。

# SocialProfileLinkTwitterCaption
source: URL of your X / Twitter profile:
es_mx: URL de tu perfil X/Twitter:
pt: URL do seu perfil X/Twitter:
zh_hans: 您的 X/Twitter 个人资料的 URL：

# SocialProfileLinkUrlRequiredText
source: Paste the URL of your profile.
es_mx: Pega la URL de tu perfil.
pt: Cole o URL do seu perfil.
zh_hans: 粘贴您的个人资料的 URL。

# SocialProfileOpenError
source: The social network link could not be opened.
es_mx: No se pudo abrir el enlace de la red social.
pt: Não foi possível abrir o link da rede social.
zh_hans: 社交网络链接无法打开。

# SocialProfileSaveError
source: The social network profile could not be saved.
es_mx: No se pudo guardar el perfil de la red social.
pt: Não foi possível salvar o perfil da rede social.
zh_hans: 无法保存社交网络配置文件。

# SocialProfileUnlinkConfirmText
source: Are you sure you want to unlink this social network?
es_mx: ¿Estás seguro de que quieres desvincular esta red social?
pt: Tem certeza de que deseja desvincular esta rede social?
zh_hans: 您确定要取消此社交网络的链接吗？

# SocialProfileUnlinkConfirmTitle
source: Confirm
es_mx: Confirmar
pt: Confirmar
zh_hans: 确认

# SocialProfileUnlinkedInfo
source: Social network profile unlinked successfully.
es_mx: Perfil de red social desvinculado exitosamente.
pt: Perfil de rede social desvinculado com sucesso.
zh_hans: 社交网络个人资料已成功取消链接。

# SocialProfileUnlinkError
source: An error occurred while unlinking the social network profile.
es_mx: Se produjo un error al desvincular el perfil de la red social.
pt: Ocorreu um erro ao desvincular o perfil da rede social.
zh_hans: 取消链接社交网络配置文件时发生错误。

# Message1Text
source: You found a critical bug... the project was delayed. Go back 5 spaces.
es_mx: Encontraste un bug crítico… el proyecto se atrasó. Retrocede 5 casillas.
pt: Você encontrou um bug crítico... o projeto foi adiado. Volte 5 espaços.
zh_hans: 您发现了一个严重的错误...该项目被推迟了。后退 5 个空格。

# Message2Text
source: Successful build. You move forward with confidence. Move forward 4 spaces.
es_mx: Compilación exitosa. Avanzas con confianza. Avanza 4 casillas.
pt: Construção bem-sucedida. Você avança com confiança. Avance 4 espaços.
zh_hans: 构建成功。你充满信心地前进。向前移动 4 个空格。

# Message3Text
source: Merge conflict in your branch. What a shame... go back 5 spaces.
es_mx: Merge conflict en tu rama. Qué vergüenza… retrocede 5 casillas.
pt: Mesclar conflitos em seu branch. Que pena... volte 5 espaços.
zh_hans: 合并分支中的冲突。真可惜……后退5个空格。

# Message4Text
source: Your code passed all unit tests. Quality bonus: advance 4 spaces.
es_mx: Tu código pasó todas las pruebas unitarias. Bonus de calidad: avanza 4 casillas.
pt: Seu código passou em todos os testes de unidade. Bônus de qualidade: avance 4 espaços.
zh_hans: 您的代码通过了所有单元测试。质量加成：前进4位。

# Message5Text
source: You had to reinstall Visual Studio. You waste valuable time. go back 5 spaces
es_mx: Tuviste que reinstalar Visual Studio. Pierdes tiempo valioso. retrocede 5 casillas
pt: Você teve que reinstalar o Visual Studio. Você perde um tempo valioso. volte 5 espaços
zh_hans: 您必须重新安装 Visual Studio。你浪费了宝贵的时间。后退 5 个空格
