Repository: Bunnn12/SnakeAndLaddersFinalProject
Catalog: SnakeAndLaddersFinalProject/Properties/Langs/Lang.*.resx
Languages: es_mx, pt, zh_hans

# GameLeftPlayerFallbackNameFmt
source: Player {0}
es_mx: Jugador {0}
pt: Jogador {0}

# GameLeftPlayerMessageFmt
source: {0} left the match.
es_mx: {0} abandonó el partido.
pt: {0} saiu da partida.

# GamePlayerLeftTitle
source: Player left
es_mx: Jugador izquierdo
pt: Jogador saiu

# PodiumUnknownWinnerNameText
source: Unknown winner
es_mx: Ganador desconocido
pt: Vencedor desconhecido

# PasswordRulesText
source: Password must be at least 8 chars, 1 Uppercase, 1 Lowercase, 1 Special Char and 1 Number.
es_mx: La contraseña debe tener al menos 8 caracteres, 1 mayúscula, 1 minúscula, 1 carácter especial y 1 número.
pt: A senha deve ter pelo menos 8 caracteres, 1 maiúscula, 1 minúscula, 1 caractere especial e 1 número.

# AuthSessionAlreadyActive
source: The session is already active, please logout to continue
es_mx: La sesión ya está activa, cierre sesión para continuar
pt: A sessão já está ativa, saia para continuar

# btnApplyText
source: Apply
es_mx: Aplicar
pt: Aplicar

# ChatTextTooLongFmt
source: The message cannot exceed {0} characters
es_mx: El mensaje no puede exceder los {0} caracteres
pt: A mensagem não pode exceder {0} caracteres

# lblWinnerLabelText
source: Winner
es_mx: Ganador
pt: Ganhador

# SkinsAvatarLockedWarn
source: This avatar is locked. Unlock it in the store to use it.
es_mx: Este avatar está bloqueado. Desbloquéalo en la tienda para usarlo.
pt: Este avatar está bloqueado. Desbloqueie-o na loja para usá-lo.

# SkinsAvatarUpdatedSuccess
source: Avatar updated successfully
es_mx: Avatar actualizado exitosamente
pt: Avatar atualizado com sucesso

# SkinsLockedTitle
source: Avatar Locked
es_mx: Avatar bloqueado
pt: Avatar bloqueado

# SkinsSelectAvatarWarn
source: Please select an avatar first.
es_mx: Primero seleccione un avatar.
pt: Selecione um avatar primeiro.

# SkinsStatusCurrentText
source: Currently selected
es_mx: Seleccionado actualmente
pt: Atualmente selecionado

# SkinsStatusLockedText
source: Locked. Get it in the shop
es_mx: Bloqueado. Consíguelo en la tienda
pt: Bloqueado. Pegue na loja

# SkinsStatusUnlockedText
source: Unlocked. Click Apply to use.
es_mx: Desbloqueado. Haga clic en Aplicar para usar.
pt: Desbloqueado. Clique em Aplicar para usar.

# SkinsUpdatedTitle
source: Avatar Updated
es_mx: Avatar actualizado
pt: Avatar atualizado

# btnCopyLinkText
source: Copy link
es_mx: Copiar enlace
pt: Copiar link

# btnLogoutText
source: Logout
es_mx: Cerrar sesión
pt: Sair

# chkEnableText
source: Enable
es_mx: Permitir
pt: Habilitar

# colHostHeader
source: Host
es_mx: Anfitrión
pt: Hospedar

# colMatchCodeHeader
source: Code
es_mx: Código
pt: Código

# lblBoardSizeLarge
source: Large
es_mx: Grande
pt: Grande

# lblBoardSizeSmall
source: Small
es_mx: Pequeño
pt: Pequeno

# lblBoardSizeStandard
source: Standard
es_mx: Estándar
pt: Padrão

# lblDifficultyEasy
source: Easy
es_mx: Fácil
pt: Fácil

# lblDifficultyHard
source: Hard
es_mx: Dificil
pt: Difícil

# lblDifficultyMedium
source: Medium
es_mx: Medio
pt: Médio

# lblMatchInventoryTitle
source: Match inventory
es_mx: Coincidir con el inventario
pt: Inventário correspondente

# lblPrivateRoom
source: Private game
es_mx: juego privado
pt: Jogo privado

# lblSpecialTileMessage
source: Message
es_mx: Mensaje
pt: Mensagem

# lblSpecialTileTrap
source: Trap
es_mx: Trampa
pt: Armadilha

# txtRegEmailText
source: Email
es_mx: Correo electrónico
zh_hans: 电子邮件

# ProfileMenuLinkFmt
source: Link {0}
es_mx: Enlace {0}
zh_hans: 链接{0}

# SocialProfileLinkTwitterTitle
source: Link X / Twitter
es_mx: Enlace X/Twitter
zh_hans: 链接X/推特

# ProfileNetworkTwitterText
source: X/ Twitter
zh_hans: X/推特
